print("Напишите программу:\nТимофей обычно спит ночью X часов и устраивает себе днем тихий час на Y минут.\nОпределите, сколько всего минут Тимофей спит в сутки.")

X = int(input("Сколько часов Тимофей спит ночью "))
Y = int(input("Сколько митут Тимофей спит днепм "))
print(X*60 +Y)
